Documents/ESB/ESB_Consumer_0712/003TestSample/SAMPLE_XML_MUST/CardlessPayment/CL02_WdrwlCardlssPinAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CardlessPayment/WdrwlCardlssPinAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CardlessPayment</ServiceDomain>  
      <OperationName>WdrwlCardlssPinAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:WdrwlCardlssPinAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CL02</v11:TxnId>  
        <v11:TxnNo>CL0200001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CustPermId>A123456789</v11:CustPermId>  
        <v11:AcctNo>29887923</v11:AcctNo>  
        <v11:ChanId>APP</v11:ChanId>  
        <v11:RandNo>STR</v11:RandNo>  
        <v11:PinBlk>STR</v11:PinBlk>  
        <v11:BrchId>02398233</v11:BrchId>  
        <v11:UserId>1234</v11:UserId> 
      </v11:ServiceBody> 
    </v11:WdrwlCardlssPinAddRq> 
  </soap:Body> 
</soap:Envelope>
